wintersmith/contents/articles/Haskell/2015-01-11-haskell-lession-2.html
---
date: 2015-01-11 20:39:10
template: tech.jade
title: Haskell 第二课 —— 类型
category: 
chage_frequency: monthly
tag: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Type</a></li>
<li><a href="#sec-2">Type partial</a></li>
<li><a href="#sec-3">TypeClass</a></li>
<li><a href="#sec-4">Functor</a></li>
<li><a href="#sec-5">Kind</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Type</h3>
<div class="outline-text-3" id="text-1">




<pre class="example">data Maybe a = Nothing | Just a
</pre>

<dl>
<dt>Maybe</dt><dd>type constructor
</dd>
<dt>Nothing</dt><dd>variable constructor
</dd>
<dt>Just a</dt><dd>variable constructor
</dd>
<dt>a</dt><dd>type varaible
</dd>
</dl>


</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">Type partial</h3>
<div class="outline-text-3" id="text-2">




<pre class="example">type MaybeInt = Maybe Int
type EitherInt = Either Int
type EitherIntString = EitherInt String
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">TypeClass</h3>
<div class="outline-text-3" id="text-3">




<pre class="example">class YesNo a where
     yesno :: a -&gt; Bool
</pre>


<dl>
<dt>YesNo</dt><dd>typeClass
</dd>
<dt>a</dt><dd>type variable
</dd>
<dt>yesno</dt><dd>typeClass function
</dd>
</dl>

</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">Functor</h3>
<div class="outline-text-3" id="text-4">




<pre class="example">class  Functor f where 
   fmap :: (a -&gt; b) -&gt; f a -&gt; f b
</pre>


<dl>
<dt>f</dt><dd>type constructor
</dd>
<dt>a</dt><dd>type varaible a
</dd>
<dt>b</dt><dd>type variable b
</dd>
<dt>f a</dt><dd>type construct by : f a (eg. Maybe Int)
</dd>
<dt>fb</dt><dd>same
</dd>
</dl>

</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5">Kind</h3>
<div class="outline-text-3" id="text-5">

<p>   类型有Kind，即类型本身的类型，通过使用ghci 的:k 功能，可以查阅到某个类型的Kind:
</p>


<pre class="example">:k Maybe
Maybe :: * -&gt; *
:k Int
Int :: *
:k Maybe Int
Maybe Int :: *
:k Either
Either :: * -&gt; * -&gt; *
:k Either Int
Either Int :: * -&gt; *
</pre>

<ul>
<li>'*' 代表一concrete（明确）的类型，只有明确的类型才能用作变量的类型，其它类型是抽象类型或者说类型的模板
</li>
<li>* -&gt; * 代表一一个类型构造器，或者说参数化的类型，它接收一个明确类型为参数，然后构造出一个明确类型
</li>
</ul>

<p>   类型的构造器如果有多个参数（Either），那么就可以curry化，即部分应用明确类型后，生成出一个新的类型构造器
</p></div>
</div>
